Repository: PurpleBote/pbotectl
Catalog: locales/po/*/pbotectl.po
Languages: ru

source: Unknown command or parameter: %s
ru: Неизвестная команда или параметр: %s

source: daemon help
ru: помощь по демону

source: Formated request: %s
ru: Форматированный запрос: %s

source: Empty response from server
ru: Пустой ответ от сервера

source: Malformed response
ru: Повреждённый ответ

source: %d day, %d:%02d:%02d
ru: %d день, %d:%02d:%02d

source: Usage: pbotectl [OPTION...] COMMAND [COMMAND OPTION...]
ru: Использование: pbotectl [OPTION...] COMMAND [COMMAND OPTION...]

source: General options:
ru: Общие параметры:

source: -h, --help Show help information about pbotectl (this message)
ru: -h, --help Показать справочную информацию (это сообщение)

source: -v, --version Show information about pbotectl version
ru: -v, --version Показать информацию о версии pbotectl

source: Connect options:
ru: Параметры подключения:

source: -s, --socket Flag to force use socket with defaults
ru: -s, --socket Принудительно подключаться через сокет с данными по умолчанию

source: --socket=PATH Set custom path to socket
ru: --socket=PATH Подключаться через сокет по указанному пути

source: OR
ru: ИЛИ

source: -t, --tcp Flag to force use TCP with defaults
ru: -t, --tcp Принудительно подключаться через TCP с данными по умолчанию

source: --host=ADDRESS Set pboted address
ru: --host=ADDRESS Адрес pboted для подключения

source: --port=PORT Set pboted control port
ru: --port=PORT Порт pboted для подключения

source: Formatting options:
ru: Параметры форматирования:

source: -j, --json Enables output formatting to JSON
ru: -j, --json Отображать ответ в формате JSON

source: Avaliable commands:
ru: Доступные команды:

source: Basic information
ru: Базовая информация

source: help Show help information about pbotectl (this message)
ru: help Показать справочную информацию (это сообщение)

source: version Show information about pbotectl version
ru: version Показать информацию о версии pbotectl

source: or can be a part of other commands
ru: или может быть частью других комманд

source: Examine daemon state (can be a part of other commands)
ru: Исследовать состояние демона (могут быть часть других команд)

source: show Show various types of objects
ru: show Отобразить данные по объектам

source: status Show the status of various tasks
ru: status Отобразить состояние задач

source: Work with daemon
ru: Взаимодействие с демоном

source: daemon Show runtime variables (e.g. uptime, transferred data size)
ru: daemon Отобразить данные выполнения (e.g. время работы, переданные данные)

source: identity Show, create, modify, remove, update Bote identities
ru: identity Отображение, создание, изменение Bote идентичностей

source: storage Show DHT storage usage and update limit
ru: storage Отображение данных по использованию DHT, очистка, установка лимита

source: node List, add, remove, update DHT nodes
ru: node Отобразить, добавить, удалить DHT узлы

source: peer List, add, remove, update relay peers
ru: peer Отобразить, добавить, удалить реле

source: Report bugs to <%s>
ru: Сообщайте об ошибках <%s>

source: identity help
ru: помощь по идентичностям

source: Mail: b64.%s
ru: Почта: b64.%s

source: Not found
ru: Не найдено

source: Unknown error code
ru: Неизвестный код ошибки

source: Error, code: %3d, message: %s
ru: Ошибка, код: %3d, сообщение: %s

source: node help
ru: помощь по узлам

source: Nodes:
ru: Узлы:

source: node stats
ru: данные по узлам

source: Unknown option: %s
ru: Неизвестный параметр: %s

source: help Show this message
ru: help Отобразить это сообщение

source: show List peers
ru: show Список пиров

source: count Show total and good
ru: count Показать всего и хорошие

source: stats Show detailed info
ru: stats Отобразить подробную информацию

source: Peers:
ru: Пиры:

source: make_request: Socket file not exists: %s
ru: make_request: Файл сокета не существует: %s

source: make_request: Socket create error: %s
ru: make_request: Ошибка при создании сокета: %s

source: make_request: Socket connect error: %s
ru: make_request: Ошибка подключения к сокету: %s

source: make_request: Write error to socket: %s
ru: make_request: Ошибка записи в сокет: %s

source: make_request: Read error from socket: %s
ru: make_request: Ошибка чтения из сокета: %s

source: show help
ru: отображение помощи

source: show Info about storage
ru: show Информация о хранилище

source: clean Trigger storage cleanup
ru: clean Запустить очистку хранилища

source: %s, version %s
ru: %s, версия %s
